src/toir_cfe/src/Documents/торо_УстановкаАналоговНоменклатурыДляРемонтов/торо_УстановкаАналоговНоменклатурыДляРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="70713d91-cbcb-4e92-ac9f-a0a817d6e0ce">
  <name>торо_УстановкаАналоговНоменклатурыДляРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="3941362c-26be-4fff-a565-63e2a4c4214a">
    <name>ДатаНачалаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="34ec1fe8-0682-46e1-9881-f904b5468771">
    <name>ДатаОкончанияДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="424f5519-312d-42a6-ac10-615c02711cf2">
    <name>УказаниеПоПрименению</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="26bac8ba-27be-488f-ba8f-9b81a02af2d2">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="59bb11af-2006-4299-a16c-2a763773be5f">
    <name>ТехКарта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6983a326-a9e9-4d7b-b740-6b3f76280b8c">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d2c92ace-8e7a-43f2-a392-285cbac3ad37">
    <name>НаправлениеОбъектаРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1f1ae0b5-4b90-4756-96fa-c5647a70a735">
    <name>СписокОбъектовРМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8e8926b2-9f0c-491e-9210-4dda111cb257">
    <name>ВидРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="afd8c838-4157-4908-a6bc-13e15246f203">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b968bd78-d9f7-4136-b7f5-27eb5b522e66">
    <name>проф_Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="909b34e1-9074-4194-945d-47599019dd04">
    <name>Аналоги</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="516454eb-a002-4aa7-8e2d-4ae0f2cb11f7">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2d2125b4-e902-4499-8955-1cfbf0b37e03">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e5560730-2fd7-492d-80f3-ed2e8044197f">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b1c2cab1-49ce-4f27-9ed4-59c15c3d370e">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="884799a4-d659-4fea-917e-798420697301">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="2201f132-10ef-4ff7-9f15-83c61b78d683">
    <name>Материалы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="6ac84c55-480e-4ee8-b529-9b2a86b5b25b">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="84ac5858-07f7-4abb-a4c5-b59bbdff0e63">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b48b0cdc-05dd-409f-b3a0-8085af8ffa5f">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="57210a28-5600-40dd-ad64-ebc75b73765a">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e502bc90-b43e-4dc6-ac08-9de107ff5d82">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a180ce65-2990-4b3d-80fc-83f6ef430224">
      <name>КлючСвязиТехКарта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/InformationRegisters/торо_АналогиНоменклатурыДляРемонтов/торо_АналогиНоменклатурыДляРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bd75473a-e6a0-45ee-a83a-941e99a8d526">
  <name>торо_АналогиНоменклатурыДляРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="810e87f2-60ec-4c6f-a698-b46ac061bf7a">
    <name>ПериодЗавершения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="b7da3a7a-7f93-4d82-b739-a7fce6b51bb5">
    <name>УпаковкаМатериала</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="a912cf23-ea02-49c6-9436-c42a62dc455e">
    <name>КоличествоМатериала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="62b487cf-3318-420c-850b-a279c9ea8cdc">
    <name>КоличествоУпаковокМатериала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="ce89a4f9-62f1-4509-a089-dce3ae891031">
    <name>УпаковкаАналога</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="5153709f-d763-4f1c-b0b0-4662a1f640f4">
    <name>КоличествоАналога</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="8cec5131-0504-466d-ac20-43194aba1d2c">
    <name>КоличествоУпаковокАналога</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="59851635-0a58-4b1c-8731-113c1e7c611e">
    <name>Материал</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="0abaad15-010c-4720-b462-1a1169662393">
    <name>ХарактеристикаМатериала</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3e0ba762-2301-4507-bb58-f8a616708252">
    <name>ТехКарта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3abcbaea-a6e9-479b-956d-13dc9e932eb0">
    <name>КлючСвязиСпецификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1ea4a6a3-d4bb-4680-a389-ddbe5b71d9c8">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="21559ab3-21fe-4274-93d2-bead9faf4226">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="554b3f39-42e7-4c9c-93d9-4d44f5dc9c0d">
    <name>ВидРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ad8d66e2-91c2-4772-a887-4764fd6f2379">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="80a5eaa4-3b19-491a-84a3-998bc6f03267">
    <name>НаправлениеОбъектаРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="49bd9538-5775-49d3-a7d5-ee278e515679">
    <name>Аналог</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="df826c69-f7c0-41bd-a065-365bf48abb7e">
    <name>ХарактеристикаАналога</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/Documents/торо_УстановкаАналоговНоменклатурыДляРемонтов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий   

&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура проф_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Ответственный = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнойОтветственный");
	Если НЕ ЗначениеЗаполнено(Ответственный) тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;	   
	#Вставка 
	//++ Проф-ИТ, #4, Башинская А.Ю., 20.08.2023  
	Если Ссылка.Пустая() Тогда
		проф_Статус = Перечисления.проф_СтатусыРазрешенийНаЗаменуМатериалов.Создано;	
	КонецЕсли;
	#КонецВставки
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура проф_ОбработкаПроведения(Отказ, РежимПроведения)

	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);

	Документы.торо_УстановкаАналоговНоменклатурыДляРемонтов.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);

	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаАналоговВПроизводстве;
	
	#Удаление
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
	#КонецУдаления
	#Вставка
	//++ Проф-ИТ, #246, Башинская А.Ю., 10.09.2023
	Если Отказ ИЛИ Таблица.Количество() = 0  Или проф_Статус <> Перечисления.проф_СтатусыРазрешенийНаЗаменуМатериалов.Утверждено Тогда
	#КонецВставки  
		Возврат;
	КонецЕсли;

	Набор = Движения.торо_АналогиНоменклатурыДляРемонтов;
	Набор.Записывать = Истина;
	Набор.Загрузить(Таблица);

	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

&Вместо("ОбработкаПроверкиЗаполнения")
Процедура проф_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	// Дата окончания действия соглашения должна быть не меньше, чем дата начала действия.
	Если ЗначениеЗаполнено(ДатаНачалаДействия) И ЗначениеЗаполнено(ДатаОкончанияДействия) Тогда
		
		Если ДатаНачалаДействия > ДатаОкончанияДействия Тогда
			
			ТекстСообщения = НСтр("ru='Дата окончания действия разрешения должна быть не меньше даты начала'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ДатаОкончанияДействия",, Отказ);
			
		Конецесли;
		
	КонецЕсли;
	
	//++ Проф-ИТ, #288, Соловьев А.А., 31.10.2023
	//ПроверитьДублиНабора("Материалы", НСтр("ru='Обнаружено дублирование строк в наборе заменяемых материалов.'"), Отказ);
	//-- Проф-ИТ, #288, Соловьев А.А., 31.10.2023
	
	ПроверитьДублиНабора("Аналоги", НСтр("ru='Обнаружено дублирование строк в наборе аналогов.'"), Отказ);
	
	МассивНепроверяемыхРеквизитов.Добавить("Материалы.КлючСвязиТехКарта");
	
	ПараметрыПроверки = ОбщегоНазначенияУТ.ПараметрыПроверкиЗаполненияКоличества();
	ПараметрыПроверки.ИмяТЧ = "Материалы";
	ОбщегоНазначенияУТ.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ, ПараметрыПроверки);
	ПараметрыПроверки.ИмяТЧ = "Аналоги";
	ОбщегоНазначенияУТ.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ, ПараметрыПроверки);
	
	ФОИспользоватьХарактеристикиНоменклатуры = ПолучитьФункциональнуюОпцию("торо_ИспользоватьХарактеристикиНоменклатуры");	
	МассивНепроверяемыхРеквизитов.Добавить("Материалы.Характеристика");
	МассивНепроверяемыхРеквизитов.Добавить("Аналоги.Характеристика");
	Если ФОИспользоватьХарактеристикиНоменклатуры = Истина Тогда
		ПараметрыПроверки = НоменклатураСервер.ПараметрыПроверкиЗаполненияХарактеристик();
		ПараметрыПроверки.ИмяТЧ = "Материалы";
		НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ, ПараметрыПроверки);
		ПараметрыПроверки.ИмяТЧ = "Аналоги";
		НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ, ПараметрыПроверки);
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура проф_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//++ Проф-ИТ, #401, Соловьев А.А., 11.12.2023
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		проф_ОбщегоНазначенияВызовСервера.ПроверитьПризнакПодразделенияОрганизации(ЭтотОбъект["Подразделение"], Отказ);
	КонецЕсли;
	//-- Проф-ИТ, #401, Соловьев А.А., 11.12.2023
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
